# UnrecognizedSharedParameterDataType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ParameterFailures..::..UnrecognizedSharedParameterDataType Property
BuiltInFailures..::..ParameterFailures Class See Also
---
The shared parameter '...' with name '...' cannot be added because its data type is not recognized.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnrecognizedSharedParameterDataType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnrecognizedSharedParameterDataType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnrecognizedSharedParameterDataType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ParameterFailures Class
Autodesk.Revit.DB Namespace